{
  "architectures": [
    "T5BooruForMaskedLM"
  ],
  "d_ff": 2048,
  "d_kv": 64,
  "d_model": 768,
  "decoder_mlp": false,
  "decoder_start_token_id": 0,
  "dropout_rate": 0.1,
  "eos_token_id": 1,
  "feed_forward_proj": "gated-gelu",
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "label_ignore_index": -100,
  "layer_norm_epsilon": 1e-06,
  "max_ctx_len": 256,
  "model_type": "t5",
  "num_decoder_layers": 12,
  "num_heads": 12,
  "num_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "relative_attention_num_buckets": 32,
  "tie_encoder_ffns": true,
  "tie_word_embeddings": false,
  "use_conv_in": true,
  "use_sigma_reparam": true,
  "use_attn_pre_ln": false,
  "use_attn_post_ln": true,
  "vocab_size_nominal": 32169,
  "pad_vocab_to_multiple": 8
}
