{
  "architectures": [
    "T5BooruForMaskedLM"
  ],
  "cross_attn_avg_key_len_init": 18,
  "d_ff": 1024,
  "d_kv": 64,
  "d_model": 512,
  "decoder_mlp": false,
  "decoder_start_token_id": 0,
  "dropout_rate": 0.1,
  "eos_token_id": 1,
  "feed_forward_proj": "gated-gelu",
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "label_ignore_index": -100,
  "layer_norm_epsilon": 1e-06,
  "max_ctx_len": 256,
  "model_type": "t5",
  "num_decoder_layers": 8,
  "num_heads": 6,
  "num_layers": 8,
  "output_past": true,
  "pad_token_id": 0,
  "relative_attention_num_buckets": 32,
  "s_reparam_config": {
    "n_iters": 1,
    "n_iters_init": 15,
    "eps": 1e-12,
    "learn_gamma": true,
    "register_v_during_construction": true
  },
  "self_attn_avg_key_len_init": 81,
  "tie_encoder_ffns": true,
  "tie_word_embeddings": false,
  "use_conv_in": true,
  "use_sigma_reparam": true,
  "use_attn_pre_ln": false,
  "use_attn_post_ln": true,
  "vocab_size_nominal": 32169,
  "pad_vocab_to_multiple": 8
}